<?php

// PSR-1:

class BadClass{
    //Константи класу ПОВИННІ бути оголошені у верхньому регістрі з роздільниками підкреслення.
    const Version = '1.0';

    //4.3. Методи
    //Імена методів ПОВИННІ бути оголошені в camelCase().
    function  snake_case()
    {

    }

}

// PSR-12:

$expr1 = rand(0, 1);
$expr2 = rand(0, 1);

$i = 0;
$j = 0;

$input = 0;

//  5.1 if, elseif, else

if
( $expr1 && $expr2 )
{
    // if body
}
else if
( $expr2 )
{
    // elseif body
}
else
{
    // else body;
}

//6.1. Унарні оператори

//Оператори збільшення/зменшення НЕ ПОВИННІ мати пробіл між оператором і операндом.

$i ++;
++ $j;

//Оператори приведення типу НЕ ПОВИННІ містити пробіли в круглих дужках:

$intValue = ( int ) $input;


// Замикання ПОВИННІ бути оголошені з пробілом після function ключового слова,
// а також пробілом перед і після use ключового слова.

$closureWithArgsAndVars = function
(
    $arg1,$arg2
)
use
(
    $expr1,
    $expr2
)
{
    // body
};

//Закриваючий тег ПОВИНЕН бути пропущений у файлах, які містять лише PHP.
?>