<?php declare(strict_types=1);

// PSR-1:

class GoodClass
{
    // Константи класу ПОВИННІ бути оголошені у верхньому регістрі з роздільниками підкреслення.
    const VERSION = '1.0';

    // 4.3. Методи
    // Імена методів ПОВИННІ бути оголошені в camelCase().
    function camelCase()
    {

    }

}

// PSR-12:

$expr1 = rand(0, 1);
$expr2 = rand(0, 1);

$i = 0;
$j = 0;

$input = 0;

//  5.1 if, elseif, else

// Структура if виглядає наступним чином.
// Зверніть увагу на розташування дужок, пробілів і дужок;
// і else знаходяться elseif на тому самому рядку, що й закриваюча дужка з попереднього тіла.

// Вирази в дужках МОЖУТЬ бути розділені на кілька рядків,
// де кожен наступний рядок має відступ принаймні один раз.
// При цьому перша умова ПОВИННА бути в наступному рядку.
// Дужки, що закриваються, і дужки, що відкривають, ПОВИННІ розташовуватися разом у окремому рядку з одним інтервалом між ними.
// Логічні оператори між умовами ПОВИННІ завжди бути на початку або в кінці рядка, а не поєднання обох.

if (
    $expr1
    && $expr2
) {
    // if body
} elseif ($expr2) {
    // elseif body
} else {
    // else body;
}

// 6.1. Унарні оператори

// Оператори збільшення/зменшення НЕ ПОВИННІ мати пробіл між оператором і операндом.

$i++;
++$j;

// Оператори приведення типу НЕ ПОВИННІ містити пробіли в круглих дужках:

$intValue = (int)$input;

// Замикання ПОВИННІ бути оголошені з пробілом після function ключового слова,
// а також пробілом перед і після use ключового слова.

$closureWithArgsAndVars = function ($arg1, $arg2) use ($expr1, $expr2) {
    // body
};


